Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.ATFXImportOptions)
Imports an ATFX file into the document.
file:
Full path of the file to import. File must exist and must be a valid ATFX file.
options:
Various import options applicable to the ATFX format.
Returns:
Returns the element Ids of the created DirectShapes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for ATFX import (.atfxz files are valid).
-or-
NullOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
Document this Document may not contain DirectShape or DirectShapeType objects.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeImporter functionality is not available in the installed Revit.
Since:
2023

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.FDXImportOptions)
Imports data from cloud data exchange into the document.
getExchangeUrl:
GET exchanges URL of the file hosting an existing FDX exchange.
options:
Various import options applicable to the Data Exchange format.
Returns:
Returns the element Ids of the created DirectShapes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
Document this Document may not contain DirectShape or DirectShapeType objects.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The FDX Import module is not available in the installed Revit.
Since:
2024

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.ATFXMLImportOptions)
Imports an ATF XML file into the project document.
file:
Full path of the file to import. File must exist and must be a valid ATF XML file.
options:
Various import options applicable to the ATF XML format.
Returns:
Returns the element Ids of the created DirectShapes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
Document this Document may not contain DirectShape or DirectShapeType objects.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeImporter functionality is not available in the installed Revit.
Since:
2022

Autodesk.Revit.DB.Document.IsInEditMode
Indicates if the document is in an edit mode.
Returns:
Returns true if the document is in an edit mode, false otherwise.
Since:
2025.2

Autodesk.Revit.DB.Document.EraseSchemaAndAllEntities(Autodesk.Revit.DB.ExtensibleStorage.Schema)
Erases Schema and all its Entities from the document.
Remarks:
The Schema remains in memory.
Any schema the schema is a sub-schema for will not be impacted.
All data referenced by the schema as the result of being a sub-schema will remain in the document.
schema:
The Schema to erase.
Throws Autodesk.Revit.Exceptions.ArgumentException:
No write access to this Schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2021

Autodesk.Revit.DB.Document.IsBackgroundCalculationInProgress
Indicates whether there are any background calculations in progress for this document.
Remarks:
When a document has background export in progress,
users cannot perform document close.
For any other background calculation in progress, users cannot perform the following operations:
Save/Close the document.Export/Print the document.Synchronize to central, in worksharing environment.Create a steel element.Copy/Mirror/Rotate a steel element.Edit the sketch of plate element.Edit a custom connection.
Returns:
Returns true if the document has any data calculation in progress and false otherwise.
Since:
2019.1

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.STEPImportOptions,Autodesk.Revit.DB.View)
Links an STEP file into the project document.
Remarks:
Link isn't supported for family documents. Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid STEP file.
options:
Various import options applicable to the STEP format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the linked file. If the options specify ThisViewOnly, this argument is required and the linked file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for STEP import (.step, .stp., .stpz files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The STEP Import/Link module is not available in the installed Revit.
Since:
2025

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.STEPImportOptions,Autodesk.Revit.DB.View)
Imports a STEP file into the document.
file:
Full path of the file to import. File must exist and must be a valid STEP file.
options:
Various import options applicable to the STEP format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
Returns:
Returns the element Id of the imported instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for STEP import (.step, .stp., .stpz files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The STEP Import/Link module is not available in the installed Revit.
Since:
2024.2

Autodesk.Revit.DB.Document.Export(System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.PDFExportOptions)
Exports a selection of views in PDF format.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
viewIds:
Selection of ordered views to be exported.
The list must contain at least one valid view.
options:
Various options applicable to the PDF format.
Returns:
True if all specified views are exported successfully,
False if exporting of any view fails, even if some views might have been exported successfully.
Throws Autodesk.Revit.Exceptions.ArgumentException:
non empty list of views must be provided.
-or-
NullOrEmpty
-or-
There are duplicate views in viewIds
-or-
some of the views are not printable (exportable).
-or-
Thrown when one or more input arguments are invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
Thrown when the target PDF file is inaccessible, e.g. already opened.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A PDF Export is already occurring on this document.
-or-
There are too many PDF Exports in progress (3).
-or-
A PDF Export cannot occur in the background in a Family document.
-or-
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Since:
2022

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.STEPExportOptions)
Exports the current view or a selection of views in STEP format.
Remarks:
All the views must be 3D views for the Export to succeed.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
name:
Either the name of a single file or a prefix for a set of files.
If empty, automatic naming will be used.
options:
Various options applicable to the STEP format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
The provided options do not specify a printable 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit, or the Material Library is missing.
Since:
2025